In [2]:
import numpy as np
import pandas as pd

## Data Frame serilerin yan yana gelmesinden oluşmuş excel tablosu benzeri bir yapı.

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 1.36157004,  1.67395872,  0.97704954],
       [ 1.0434376 , -0.24431582,  2.3683371 ],
       [-2.08097894,  0.31712706, -0.09676536],
       [ 0.23603558,  0.04345822, -0.50971265]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  1.361570  1.673959  0.977050
1  1.043438 -0.244316  2.368337
2 -2.080979  0.317127 -0.096765
3  0.236036  0.043458 -0.509713

In [7]:
dataFrame

          0         1         2
0  1.361570  1.673959  0.977050
1  1.043438 -0.244316  2.368337
2 -2.080979  0.317127 -0.096765
3  0.236036  0.043458 -0.509713

In [8]:
yeniDataFrame = pd.DataFrame(data,index=["Doğukan","Zeynep","Atlas","Mehmet"],columns=["Yas","Maas","Çalışma Saati"])

In [9]:
yeniDataFrame

              Yas      Maas  Çalışma Saati
Doğukan  1.361570  1.673959       0.977050
Zeynep   1.043438 -0.244316       2.368337
Atlas   -2.080979  0.317127      -0.096765
Mehmet   0.236036  0.043458      -0.509713

In [10]:
yeniDataFrame["Maas"]

Doğukan    1.673959
Zeynep    -0.244316
Atlas      0.317127
Mehmet     0.043458
Name: Maas, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

             Maas       Yas
Doğukan  1.673959  1.361570
Zeynep  -0.244316  1.043438
Atlas    0.317127 -2.080979
Mehmet   0.043458  0.236036

In [12]:
yeniDataFrame.loc["Doğukan"]

Yas              1.361570
Maas             1.673959
Çalışma Saati    0.977050
Name: Doğukan, dtype: float64

In [13]:
yeniDataFrame.iloc[0] # indexe göre

Yas              1.361570
Maas             1.673959
Çalışma Saati    0.977050
Name: Doğukan, dtype: float64

## İndexler

In [14]:
yeniDataFrame["Maas"]

Doğukan    1.673959
Zeynep    -0.244316
Atlas      0.317127
Mehmet     0.043458
Name: Maas, dtype: float64

In [15]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [16]:
yeniDataFrame

              Yas      Maas  Çalışma Saati  Emeklilik Yasi
Doğukan  1.361570  1.673959       0.977050        2.723140
Zeynep   1.043438 -0.244316       2.368337        2.086875
Atlas   -2.080979  0.317127      -0.096765       -4.161958
Mehmet   0.236036  0.043458      -0.509713        0.472071

In [17]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1) # Axis naormalde 0 gelir ve satır düşürür. Axis 1 ise sütun düşürür.

              Yas      Maas  Çalışma Saati
Doğukan  1.361570  1.673959       0.977050
Zeynep   1.043438 -0.244316       2.368337
Atlas   -2.080979  0.317127      -0.096765
Mehmet   0.236036  0.043458      -0.509713

In [18]:
yeniDataFrame.drop("Mehmet")

              Yas      Maas  Çalışma Saati  Emeklilik Yasi
Doğukan  1.361570  1.673959       0.977050        2.723140
Zeynep   1.043438 -0.244316       2.368337        2.086875
Atlas   -2.080979  0.317127      -0.096765       -4.161958

In [19]:
yeniDataFrame # Düşürme işlemleri işlemedi. İşlemesi için inplace = true olmalı.

              Yas      Maas  Çalışma Saati  Emeklilik Yasi
Doğukan  1.361570  1.673959       0.977050        2.723140
Zeynep   1.043438 -0.244316       2.368337        2.086875
Atlas   -2.080979  0.317127      -0.096765       -4.161958
Mehmet   0.236036  0.043458      -0.509713        0.472071

In [20]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1,inplace=True)

In [21]:
yeniDataFrame

              Yas      Maas  Çalışma Saati
Doğukan  1.361570  1.673959       0.977050
Zeynep   1.043438 -0.244316       2.368337
Atlas   -2.080979  0.317127      -0.096765
Mehmet   0.236036  0.043458      -0.509713

In [22]:
yeniDataFrame.loc["Doğukan"]["Maas"]

1.6739587229369108

In [23]:
yeniDataFrame.loc["Doğukan","Maas"]

1.6739587229369108

In [24]:
yeniDataFrame

              Yas      Maas  Çalışma Saati
Doğukan  1.361570  1.673959       0.977050
Zeynep   1.043438 -0.244316       2.368337
Atlas   -2.080979  0.317127      -0.096765
Mehmet   0.236036  0.043458      -0.509713

In [25]:
yeniDataFrame < 0

           Yas   Maas  Çalışma Saati
Doğukan  False  False          False
Zeynep   False   True          False
Atlas     True  False           True
Mehmet   False  False           True

In [26]:
booleanFrame = yeniDataFrame < 0

In [27]:
yeniDataFrame[booleanFrame]

              Yas      Maas  Çalışma Saati
Doğukan       NaN       NaN            NaN
Zeynep        NaN -0.244316            NaN
Atlas   -2.080979       NaN      -0.096765
Mehmet        NaN       NaN      -0.509713

In [28]:
yeniDataFrame[yeniDataFrame < 0]

              Yas      Maas  Çalışma Saati
Doğukan       NaN       NaN            NaN
Zeynep        NaN -0.244316            NaN
Atlas   -2.080979       NaN      -0.096765
Mehmet        NaN       NaN      -0.509713

In [29]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

              Yas      Maas  Çalışma Saati
Doğukan  1.361570  1.673959       0.977050
Zeynep   1.043438 -0.244316       2.368337
Mehmet   0.236036  0.043458      -0.509713

## İndexler

In [30]:
yeniDataFrame.reset_index()

     index       Yas      Maas  Çalışma Saati
0  Doğukan  1.361570  1.673959       0.977050
1   Zeynep  1.043438 -0.244316       2.368337
2    Atlas -2.080979  0.317127      -0.096765
3   Mehmet  0.236036  0.043458      -0.509713

In [31]:
yeniDataFrame

              Yas      Maas  Çalışma Saati
Doğukan  1.361570  1.673959       0.977050
Zeynep   1.043438 -0.244316       2.368337
Atlas   -2.080979  0.317127      -0.096765
Mehmet   0.236036  0.043458      -0.509713

In [32]:
isimListesi = ["Doğ","Zey","Atl","Meh"]

In [33]:
yeniDataFrame["Yeni Index"] = isimListesi

In [34]:
yeniDataFrame

              Yas      Maas  Çalışma Saati Yeni Index
Doğukan  1.361570  1.673959       0.977050        Doğ
Zeynep   1.043438 -0.244316       2.368337        Zey
Atlas   -2.080979  0.317127      -0.096765        Atl
Mehmet   0.236036  0.043458      -0.509713        Meh

In [35]:
yeniDataFrame.set_index("Yeni Index")

                 Yas      Maas  Çalışma Saati
Yeni Index
Doğ         1.361570  1.673959       0.977050
Zey         1.043438 -0.244316       2.368337
Atl        -2.080979  0.317127      -0.096765
Meh         0.236036  0.043458      -0.509713

In [36]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [37]:
yeniDataFrame

                 Yas      Maas  Çalışma Saati
Yeni Index
Doğ         1.361570  1.673959       0.977050
Zey         1.043438 -0.244316       2.368337
Atl        -2.080979  0.317127      -0.096765
Meh         0.236036  0.043458      -0.509713

In [38]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [39]:
icIndexler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [40]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [41]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [42]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [43]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [44]:
cizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [45]:
cizgiFilmNumpyDizisi = np.array(cizgiFilmListem)

In [46]:
cizgiFilmNumpyDizisi

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [47]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["Yas","Meslek"])

In [48]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [49]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [50]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [51]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [52]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F